import type {JSX, PropsWithChildren} from 'react';
import ProfileAvatar from "../../components/profile-avatar";
import Wrapper from "../../components/wrapper";
import './style.scss'
import Title from "./title";

const About = () => (
    <div className="about">
        <h3>About me</h3>
        <p>Software engineer із безперервним комерційним досвідом розробки з 2005 року. Основний фокус і найсильніша сторона — створення програмних продуктів з нуля, включно з проєктуванням архітектури та реалізацією повного технологічного стеку.
            Маю практичний досвід повного циклу розробки та здатний самостійно доводити проєкт від технічної концепції до production-релізу. Водночас найбільш ефективно працюю в командній моделі, де комунікація із замовником і керування вимогами здійснюється проєктним менеджером або аналітиком. Такий підхід допомагає уникати викривлення вимог і дозволяє повністю зосередитися на інженерних завданнях — архітектурі, реалізації та довгостроковій технічній стабільності рішення.
            Переважно працюю в українських інженерних командах, де налагоджена чітка професійна комунікація та спільна робоча мова всередині команди. У командній розробці вважаю важливим наявність єдиного технічного й комунікаційного контексту, що позитивно впливає на якість рішень, швидкість розробки та передбачуваність результату.
            Комфортно працюю як самостійно, так і в складі організованих команд із чітко визначеними ролями та процесами. Надаю перевагу моделям співпраці, у яких компанія виступає повноцінною відповідальною стороною проєкту, забезпечуючи координацію, підтримку процесів і відповідальність за результат, а не перекладаючи управлінські чи клієнтські функції на розробників.
            Завдяки тривалому й безперервному досвіду маю широке розуміння web-розробки, сучасних і усталених технологій та поширених архітектурних підходів. Віддаю перевагу прагматичному інженерному підходу без зайвої складності, з фокусом на якості, підтримуваності та сталому розвитку продукту.
        </p>
    </div>
)

export default function Hero( props: PropsWithChildren ): JSX.Element {
    return (
        <>
            { props.children  }
            <div className="hero">
                <div className="left">
                    <ProfileAvatar/>
                    <Wrapper>
                        <Title/>
                    </Wrapper>
                </div>
                <div className="context">
                    <Wrapper>
                        <About/>
                    </Wrapper>
                </div>
            </div>
        </>
    )
}